georgik/esp32-graphical-bootloader/apps/synth_piano/sdkconfig.defaults.esp-box-3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# BSP Selection
CONFIG_BSP_SELECT_ESP_BOX_3=y

# LVGL configuration (updated for LVGL 9.x)
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_32=y
